package lesson_11;

// На компьютере будет создан файл Hello.java#
// Ctrl +/ закомментировать строку или раскомментировать строку
// Функция в Python = метод в Java -  это набор инструкций, которые выполняются вместе
// Метод main - Это специальный метод, который говорит, с чего начать выполнять программу
// Название класса должно совпадать с названием файла в котором он написан
// Переименовать файл - refactor- rename (класса и названия переменной и названия метода и т д)
// /* ... /* - Многострочный комментарий - аналог """ ... """ в Питоне

public class HelloJava {
    /*
    1. Команда 1
    2. Команда 2
    */

    //    1. psvm (public static void main); 2. main
    //    snip-it - сокращения для сгенерированной сигнатуры метода main

    public static void main(String[] args) {
        //    Мы можем написать инструкции, которые будут выполнены, при запуске класса Hello
        // sout (system.out)
        System.out.println("Hello, world!");
        // Ctrl + y, Cmd + <-- - удаление строки
    }


}
