package lesson_27;

public class Quiz {

    /*
    С помощью какого механизма можно избежать дублирования в двух классах?
    - наследование

    С помощью какого ключевого слова мы наследуем?
    - extends

    A extends B - Где предок, где потомок?
    В - предок
    А - потомок

    С помощью какого модификатора можно сделать так, чтобы метод или поле были доступны в потомке?
    - protected
    - public

    Какие элементы класса родителя копируются в класс потомок?
    - поля
    - методы

    - НЕ КОПИРУЮТСЯ КОНСТРУКТОРЫ

    Как принудительно вызвать конструктор предка в конструкторе потомка?
    -  super();

    Что будет, если в конструкторе потомка не вызвать явно конструктор предка?
    - Java попытается вызвать пустой конструктор предка (super())
    - А если такого конструктора нет, будет ошибка компиляции - программа не запустится

     */
}
